src/AccumulationRegisters/РН_МестаНакопленияДенег/РН_МестаНакопленияДенег.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>РН_МестаНакопленияДенег</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Основание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>МестоХраненияДС</name>
    <type>
      <types>CatalogRef.ИсточникХраненияДС</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ОтКогоКомуКуда</name>
    <type>
      <types>CatalogRef.КонтрагентМесто</types>
      <types>CatalogRef.ФизЛица</types>
      <types>String</types>
      <types>CatalogRef.Люди</types>
      <types>CatalogRef.Семья</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/Catalogs/Номенклатура/Номенклатура.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Номенклатура</name>
  <basedOn>Catalog.Номенклатура</basedOn>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>ОснЕдИзмерения</name>
    <type>
      <types>CatalogRef.ЕденицаИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>ФирмаПроизводитель</name>
    <type>
      <types>CatalogRef.Производители</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕдИзмСравнения</name>
    <type>
      <types>CatalogRef.ЕденицаИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>КолВоСравнения</name>
    <comment>в кг.</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ценность</name>
    <type>
      <types>CatalogRef.Ценность</types>
    </type>
  </attributes>
  <attributes>
    <name>ЦельПлатежа</name>
    <type>
      <types>CatalogRef.Цели</types>
    </type>
  </attributes>
  <attributes>
    <name>ГруппаНоменклатуры</name>
    <type>
      <types>CatalogRef.ГруппаНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбъектПлатежа</name>
    <type>
      <types>CatalogRef.ДомашниеЖивотные</types>
      <types>CatalogRef.Контрагенты</types>
      <types>CatalogRef.Места_Объекты</types>
      <types>String</types>
      <types>CatalogRef.Люди</types>
      <types>CatalogRef.Проекты</types>
      <types>CatalogRef.Семья</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПолноеНаименование</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ВРазныхТарах</name>
    <attributes>
      <name>ЕдИзм</name>
      <type>
        <types>CatalogRef.ЕденицаИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>Объем</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КолВУпак</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Описание</name>
    <attributes>
      <name>Описание</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Свойства</name>
    <attributes>
      <name>СвойствоНоменклатуры</name>
      <type>
        <types>CatalogRef.ДопСвойстваНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/CommonModules/ОбращБД/Module.bsl
Функция ИсточникОплатыПриИзмененииНаСервере(ИсточникОплаты)  Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИсточникХраненияДС.Владелец КАК Владелец,
		|	РН_МестаНакопленияДенегОстатки.СуммаОстаток
		|ИЗ
		|	Справочник.ИсточникХраненияДС КАК ИсточникХраненияДС
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РН_МестаНакопленияДенег.Остатки КАК РН_МестаНакопленияДенегОстатки
		|		ПО РН_МестаНакопленияДенегОстатки.МестоХраненияДС = ИсточникХраненияДС.Ссылка
		|ГДЕ
		|	ИсточникХраненияДС.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", ИсточникОплаты);
	РЗ = Запрос.Выполнить();
	ВЗ = РЗ.Выбрать();
	ВЗ.Следующий(); 
	СтруктЗапроса = Новый Структура("Плательщик,ОстатокИсточникаОплаты",ВЗ.Владелец,ВЗ.СуммаОстаток); 
	Возврат   СтруктЗапроса;
КонецФункции


Функция ЗаполнениеДопСвойствНоменклатуры(Стр) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Номенклатура.Ценность,
		|	Номенклатура.ЦельПлатежа,
		|	Номенклатура.ГруппаНоменклатуры,
		|	Номенклатура.ОбъектПлатежа,
		|	Номенклатура.ОснЕдИзмерения,
		|	Номенклатура.ЕдИзмСравнения,
		|	Номенклатура.КолВоСравнения
		|ИЗ
		|	Справочник.Номенклатура КАК Номенклатура
		|ГДЕ
		|	Номенклатура.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Стр.Номенклатура);
	
	РЗ = Запрос.Выполнить();
	
	ВЗ = РЗ.Выбрать();
	ВЗ.Следующий(); 
	ЗаполнитьЗначенияСвойств(Стр,ВЗ);
	Возврат   Стр;
КонецФункции
